from plotter import plot_graphic
from extremum import find_extremum


def main():
    glr, fib = find_extremum()
    plot_graphic()
    print("--------------------------------------------------------------")
    print("Аналитическое значение экстремума: -1")
    print("Значение функции в точке экстремума: 1,(6)")
    print("--------------------------------------------------------------")
    print("Экстремум, полученный с помощью метода Золотого сечения:", glr[0])
    print("Значение функции в точке экстремума:", glr[1])
    print(glr[2])
    print("--------------------------------------------------------------")
    print("Экстремум, полученный с помощью метода Фибоначчи", fib[0])
    print("Значение функции в точке экстремума:", fib[1])
    print(fib[2])

if __name__ == "__main__":
    main()
